Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter.#ctor(System.Collections.Generic.IList{System.Double})
Creates object from an array of one-dimensional point coordinates
points:
Array of one-dimensional point coordinates representing domain points (using raw parameters when on a curve)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011